Channel/1D/R2000/0/RS_DNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      RS_DNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor> 
1025
(
(6.40561e-07 -1.78018e-10 2.00826e-10 1.59377e-12 -5.79885e-14 2.83026e-07)
(5.53422e-06 -4.06346e-09 1.75289e-09 8.2191e-11 -1.33314e-12 2.40289e-06)
(1.52227e-05 -1.85356e-08 4.87165e-09 5.93914e-10 -6.11881e-12 6.49088e-06)
(2.99804e-05 -5.24665e-08 9.69892e-09 2.32978e-09 -1.74028e-11 1.25373e-05)
(4.7991e-05 -1.02128e-07 1.56417e-08 5.25546e-09 -3.39474e-11 1.97959e-05)
(7.33849e-05 -1.99889e-07 2.41879e-08 1.25669e-08 -6.65898e-11 2.96406e-05)
(0.000100617 -3.14768e-07 3.34093e-08 2.18702e-08 -1.04924e-10 4.0069e-05)
(0.000136558 -5.13333e-07 4.58438e-08 4.09881e-08 -1.71082e-10 5.3228e-05)
...
)
;

boundaryField
{
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    CENTER
    {
        type            symmetryPlane;
    }
    WALL
    {
        type            fixedValue;
        value           uniform (6.66667e-11 0 0 6.66667e-11 0 6.66667e-11);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
