Channel/1D/R2000/0/divRS_DNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      divRS_DNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];


internalField   nonuniform List<vector> 
1025
(
(-5.49249e-05 -6.45466e-07 -1.80143e-08)
(-0.000236795 7.63765e-06 -7.81784e-08)
(-0.000621684 2.88581e-05 -2.06396e-07)
(-0.00106916 5.96128e-05 -3.55933e-07)
(-0.00187612 0.000130248 -6.2596e-07)
(-0.00269495 0.000210552 -8.99543e-07)
(-0.00395217 0.000358293 -1.31753e-06)
(-0.00499873 0.00048128 -1.66549e-06)
...
)
;

boundaryField
{
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    CENTER
    {
        type            symmetryPlane;
    }
    WALL
    {
        type            extrapolatedCalculated;
        value           uniform (-5.49249e-05 -6.45466e-07 -1.80143e-08);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
