Channel/1D/R2000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

Lx		0.1;
Ly		1;
Lz		0.1;

vertices
(
	(0     0    0)
	($Lx   0    0)
	($Lx   1    0)
	(0     1    0)
	(0     0  $Lz)
	($Lx   0  $Lz)
	($Lx   1  $Lz)
	(0     1  $Lz)
);

k	122.598441;
ik  8.156711e-3;
// ySpacing ((0.5 0.5 $k)(0.5 0.5 $ik));

blocks
(
    hex (0 1 2 3 4 5 6 7) 
	(1 1025 1) 
	simpleGrading (1 $k 1)
);

edges
(
);

boundary
(
	INLET
	{
		type			cyclic;
		neighbourPatch	OUTLET;
		faces
		(
			(0 4 7 3)
		);
	}
	
	OUTLET
	{
		type			cyclic;
		neighbourPatch  INLET;
		faces
		(
			(1 2 6 5)
		);
	}

	CENTER
	{
		type			symmetryPlane;
		faces
		(
			(3 7 6 2)
		);
	}

	WALL
	{
		type			wall;
		faces
		(
			(0 1 5 4)
		);
	}

	frontAndBackPlanes
	{
		type			empty;
		faces
		(
			(0 3 2 1)
			(4 5 6 7)
		);
	}

);

mergePatchPairs
(
);

// ************************************************************************* //
